[
  {
    "id": "b91e6501-9bc9-5f31-b0e3-368eb49d8e12",
    "article": "Mission and History",
    "content": "The ASPCA was founded in 1866 and was the first animal welfare organization in North America. Our mission is to provide effective means for the prevention of cruelty to animals throughout the United States.",
    "created_at": "2025-08-12T14:47:38.832929",
    "updated_at": "2025-08-12T14:47:38.832931",
    "source": "upload",
    "source_file": "aspca_mission.txt",
    "chunk_index": null
  },
  {
    "id": "bb62c9b4-a6b3-50aa-970d-552bd2e9546b",
    "article": "Services and Programs",
    "content": "We provide animal rescue and placement, animal health services, anti-cruelty initiatives, and community outreach programs. Our work includes disaster response, animal behavior training, and legislative advocacy.",
    "created_at": "2025-08-12T14:47:38.832942",
    "updated_at": "2025-08-12T14:47:38.832943",
    "source": "upload",
    "source_file": "aspca_services.txt",
    "chunk_index": null
  },
  {
    "id": "36d56ba2-b5bc-56e1-849e-9ec642c78ebb",
    "article": "DARKBO Advanced Features",
    "content": "DARKBO Advanced Features Test Document This document tests the advanced document processing capabilities of DARKBO. Key Features: - Intelligent text chunking with overlap - Metadata extraction and storage - Versioned index building - Atomic index updates - Background processing The system ensures that queries continue to work while new indexes are being built. This provides a seamless user experience even during large document ingestions. Processing Pipeline: 1. Document upload and validation 2. Text extraction and cleaning 3. Intelligent chunking 4. Knowledge base entry creation 5. Background index rebuilding 6. Atomic version switching This comprehensive approach ensures both reliability and performance.",
    "created_at": "2025-08-12T15:58:34.206667",
    "updated_at": "2025-08-12T15:58:34.206671",
    "source": "test_upload",
    "source_file": null,
    "chunk_index": null
  }
]